import MatrixImage from './images/matrix.png';
import ComputerImage from './images/computer.png';

const data = {
  time: 1609292702609,
  blocks: [
    {
      type: 'header',
      data: {
        text: '❓Вступ',
        level: 1,
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Сучасна комп'ютерна графіка визначається багатьма напрямками і різноманітними застосуваннями. Для одних з них, наприклад, основою є автоматизація креслення технічної документації, для інших - проблеми оперативної взаємодії людини і комп'ютера. Сучасне розширення можливостей комп’ютерів, створених для виконання обчислень, дає можливість комп'ютеру сприймати і наочно зображувати результати обчислень, будувати необхідні комплексні креслення, схеми і т.п.. ",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Зорове сприйняття графічної інформації для людини має важливе значення, обсяг і швидкість сприйняття зорових образів значні. Для представлення особливостей чи креслення будь-якого процесу досить декількох секунд, під час яких ми розглядаємо креслення, графік функції чи інше наочне зображення. Отже, важливість наочного представлення комп'ютером інформації важко переоцінити.",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Коротка історія розвитку комп'ютерної графіки.",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Перша офіційно визнана спроба використання дисплея для виводу зображення з ЕОМ - Массачусетський технологічний університет (МТІ), машина Whirlwind-I в 1950 р. А сам термін \"комп'ютерна графіка\" вперше використав в 1960 р. співробітник компанії Boeing У. Феттер.<br>На початку свого розвитку комп'ютерну графіку розглядали, як частину системного програмування для ЕОМ чи один з розділів систем автоматизованого проектування (САПР).<br>",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Перше реальне застосування КГ пов'язують з ім'ям Дж. Уїтні. Він займався кіновиробництвом в 50-60-х роках і вперше використовував комп'ютер для створення титрів до кінофільму.<br>",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'Наступний крок у  розвитку КГ- робота Айвена Сазерленда, який в 1961р створив програму малювання, названу ним Sketchpad (альбом для малювання). Програма використовувала світлове перо для малювання найпростіших фігур на екрані. Отримані картинки можна було зберігати і відновлювати. У цій програмі було розширено коло основних графічних примітивів, зокрема, крім ліній і точок був введений прямокутник, який задавався своїми розмірами і розташуванням.<br>',
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Спочатку комп'ютерна графіка була векторною, тобто зображення формувалося з тонких ліній. Ця особливість була пов'язана з технічною реалізацією комп'ютерних дисплеїв.<br>Перша комп'ютерна відеогра - Spacewar (\"Зоряна війна\") у 1961 р. створена студентом С. Расселом.<br>",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "У зв’язку зх успіхом КГ, великі корпорації зацікавлюються розробками КГ і починають комерційно підтримувати розвиток КГ.  “Дженерал моторз”, “Дженерал електрик”, приступили до комерційних розробок в області КГ.<br>Це було використання графічної системи з розподілом часу для багатьох етапів проектування автомобілів.<br>Центр досліджень в області КГ - університет штату Юта (завдяки Д.Евансу і А.Сазерленду).<br>Учнем Сазерленда став Е.Кетмул, майбутній творець алгоритму видалення невидимих поверхонь з використанням Z-буфера (1978). Тут же працювали Дж.Варнок, автор алгоритму видалення невидимих граней на основі розбивки області (1969) та засновник Adobe System (1982), Дж.Кларка, майбутній засновник компанії Silicon Graphics (1982).<br>Всі ці дослідники дуже сильно розвинули алгоритмічну сторону комп'ютерної графіки.<br>",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'Щодо розвитку КГ в Україні, то слід зазначити, що перша інтерактивна графічна система автоматизованого проектування електронних схем була розроблена Київським політехнічним інститутом і Науково-дослідним інститутом автоматизованих систем керування і плануванні в будівництві (НДІАСК, Київ) і демонструвалася в 1969р.<br>',
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'Справжній широкий розвиток  КГ пов’язаний з появою персональних комп’ютерів «Macintosh» (МАС) фірми Apple (спеціально для потреб поліграфії).',
      },
    },
    {
      type: 'image',
      data: {
        url: MatrixImage,
        caption: '',
        withBorder: false,
        withBackground: true,
        stretched: false,
      },
    },
    {
      type: 'image',
      data: {
        url: ComputerImage,
        caption: '',
        withBorder: false,
        withBackground: true,
        stretched: false,
      },
    },
  ],
  version: '2.19.1',
};

export default data;
