import GetFractalImage from './images/1.png';
import AlgFractalImage from './images/2.png';
import StFractalImage from './images/3.png';

import GreenFractalImage from './images/4.png';

const data = {
  time: 1609290085962,
  blocks: [
    {
      type: 'header',
      data: {
        text: '❓Фрактали',
        level: 1,
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'Слово фрактал утворено від латинського fractus і в перекладі означає той, що складається з фрагментів (подрібнений).<br>',
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Термін “фрактал”запропоноване Бенуа Мандельбротом в 1975 році для позначення самоподібних структур. Народження фрактальної геометрії прийнято пов'язувати з виходом в 1977 році книги Мандельброта `The Fractal Geometry of Nature'.<br>",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'Фракталом називається структура, що складається з частин, які в якомусь сенсі подібні до цілого.<br>',
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'В основі цього явища лежить дуже проста ідея : нескінчену по красі і різноманітності множину фігур можна отримати з відносно простих конструкцій за допомогою всього двох операцій - копіювання і масштабування.<br>',
      },
    },
    {
      type: 'image',
      data: {
        url: GreenFractalImage,
        caption: '',
        withBorder: false,
        withBackground: true,
        stretched: false,
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'Фрактали знаходять все більше й більше практичних застосувань у науці. Основна причина цього полягає в тому, що вони описують реальний світ іноді навіть краще, ніж традиційна фізика чи математика. Більшість просторових систем у природі є нерегулярним і фрагментарним, форма цих систем погано піддається опису апаратом евклідової геометрії.<br>',
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'Масштабна інваріантність, що спостерігається у фракталах, може бути або точною, або наближеною. Інваріантність - незмінність якої-небудь величини по відношенню до деяких перетворень.<br>',
      },
    },
    {
      type: 'paragraph',
      data: {
        text: 'Однією з основних властивостей фракталів є самоподібність.  У найпростішому випадку невелика частина фрактала містить інформацію про весь фрактал. Серед важливих властивостей фракталів з точки зору програмної реалізації ітераційність та рекурсивність фрактальних структур.<br>',
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Фактично знайдений спосіб легкого представлення складних  об'єктів,  які  схожі на природні. Тобто за допомогою декількох коефіцієнтів можна задати лінії і поверхні дуже складної форми. Фрактальна геометрія незамінна при генерації штучних хмар, гір, поверхні морів тощо.<br>",
      },
    },
    {
      type: 'paragraph',
      data: {
        text: "Фрактальна графіка, як і векторна, заснована на математичних обчисленнях. Однак, базовим елементом є математична формула, ніяких об'єктів у пам'яті комп'ютера не зберігається і зображення будується виключно за формулами,рівняннями.",
      },
    },
    {
      type: 'image',
      data: {
        url: GetFractalImage,
        caption: 'Геометричні',
        withBorder: false,
        withBackground: true,
        stretched: false,
      },
    },
    {
      type: 'image',
      data: {
        url: AlgFractalImage,
        caption: 'Алгебраїчні',
        withBorder: false,
        withBackground: true,
        stretched: false,
      },
    },
    {
      type: 'image',
      data: {
        url: StFractalImage,
        caption: 'Стохастичні',
        withBorder: false,
        withBackground: true,
        stretched: false,
      },
    },
  ],
  version: '2.19.1',
};

export default data;
